app/controllers/api/v1/notes_controller.rb

  def create
    note = Note.create(note_params)
---
INSERT INTO "notes" ("text", "day_id", "project_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["text", "Does this work?"], ["day_id", 7], ["project_id", 6], ["created_at", "2020-04-29 19:22:07.848591"], ["updated_at", "2020-04-29 19:22:07.848591"]]