app/controllers/api/v1/projects_controller.rb

  def create
    state_params = {
      name: params[:project][:name],
      end_date: params[:project][:end_date],
      user_id: params[:project][:user_id]
    }
    project = Project.create(state_params)
---
INSERT INTO "projects" ("name", "end_date", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "TEST_PARAMS"], ["end_date", "05/05/2020"], ["user_id", 3], ["created_at", "2020-05-02 23:09:16.547253"], ["updated_at", "2020-05-02 23:09:16.547253"]]

  def createIngredients(array,id)
    array.each do |ingredient|
      newIngredient = Ingredient.create({project_id: id, name: ingredient[:name], quantity: ingredient[:quantity], units: ingredient[:units], prep: ingredient[:prep]})
---
INSERT INTO "ingredients" ("name", "quantity", "units", "prep", "project_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "Cabbage"], ["quantity", 3], ["units", "heads"], ["prep", "Quartered"], ["project_id", 10], ["created_at", "2020-05-03 17:12:39.840859"], ["updated_at", "2020-05-03 17:12:39.840859"]]

  def destroy
    project = Project.find(params[:id])
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]