app/controllers/api/v1/projects_controller.rb

INSERT INTO "vessels" ("vessel", "volume", "units", "weight", "material", "notes", "project_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def createVessels(array,id)
    array.each do |vessel|
      newVessel = Vessel.create({project_id: id, vessel: vessel[:vessel], volume: vessel[:volume], units: vessel[:units], airlock: vessel[:airloack], weight: vessel[:weight], material: vessel[:material], notes: vessel[:notes]})